{
    "modelTopology": {
        "class_name": "Sequential",
        "config": [
            {
                "class_name": "Dense",
                "config": {
                    "units": 64,
                    "activation": "linear",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 1,
                            "mode": "fan_avg",
                            "distribution": "normal",
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null,
                    "name": "dense_Dense1",
                    "trainable": true,
                    "batch_input_shape": [
                        null,
                        27
                    ],
                    "dtype": "float32"
                }
            },
            {
                "class_name": "Dense",
                "config": {
                    "units": 256,
                    "activation": "relu",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 1,
                            "mode": "fan_avg",
                            "distribution": "normal",
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null,
                    "name": "dense_Dense2",
                    "trainable": true
                }
            },
            {
                "class_name": "Dense",
                "config": {
                    "units": 256,
                    "activation": "relu",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 1,
                            "mode": "fan_avg",
                            "distribution": "normal",
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null,
                    "name": "dense_Dense3",
                    "trainable": true
                }
            },
            {
                "class_name": "Dense",
                "config": {
                    "units": 256,
                    "activation": "relu",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 1,
                            "mode": "fan_avg",
                            "distribution": "normal",
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null,
                    "name": "dense_Dense4",
                    "trainable": true
                }
            },
            {
                "class_name": "Dense",
                "config": {
                    "units": 9,
                    "activation": "softmax",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 1,
                            "mode": "fan_avg",
                            "distribution": "normal",
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null,
                    "name": "dense_Dense5",
                    "trainable": true
                }
            }
        ],
        "keras_version": "tfjs-layers 1.2.11",
        "backend": "tensor_flow.js"
    },
    "weightsManifest": [
        {
            "paths": [
                "weights.bin"
            ],
            "weights": [
                {
                    "name": "dense_Dense1/kernel",
                    "shape": [
                        27,
                        64
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "dense_Dense1/bias",
                    "shape": [
                        64
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "dense_Dense2/kernel",
                    "shape": [
                        64,
                        256
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "dense_Dense2/bias",
                    "shape": [
                        256
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "dense_Dense3/kernel",
                    "shape": [
                        256,
                        256
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "dense_Dense3/bias",
                    "shape": [
                        256
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "dense_Dense4/kernel",
                    "shape": [
                        256,
                        256
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "dense_Dense4/bias",
                    "shape": [
                        256
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "dense_Dense5/kernel",
                    "shape": [
                        256,
                        9
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "dense_Dense5/bias",
                    "shape": [
                        9
                    ],
                    "dtype": "float32"
                }
            ]
        }
    ],
    "format": "layers-model",
    "generatedBy": "TensorFlow.js tfjs-layers v1.2.11",
    "convertedBy": null
}