{"modelTopology":{"class_name":"Sequential","config":{"name":"sequential_1","layers":[{"class_name":"Dense","config":{"units":94,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense0_1587788419307","trainable":true,"batch_input_shape":[null,94],"dtype":"float32"}},{"class_name":"Dense","config":{"units":512,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense1_1587788419319","trainable":true}},{"class_name":"Dense","config":{"units":512,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense2_1587788419329","trainable":true}},{"class_name":"Dense","config":{"units":90,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense3_1587788419347","trainable":true}}]},"keras_version":"tfjs-layers 1.6.1","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense0_1587788419307/kernel","shape":[94,94],"dtype":"float32"},{"name":"dense0_1587788419307/bias","shape":[94],"dtype":"float32"},{"name":"dense1_1587788419319/kernel","shape":[94,512],"dtype":"float32"},{"name":"dense1_1587788419319/bias","shape":[512],"dtype":"float32"},{"name":"dense2_1587788419329/kernel","shape":[512,512],"dtype":"float32"},{"name":"dense2_1587788419329/bias","shape":[512],"dtype":"float32"},{"name":"dense3_1587788419347/kernel","shape":[512,90],"dtype":"float32"},{"name":"dense3_1587788419347/bias","shape":[90],"dtype":"float32"}]}],"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v1.6.1","convertedBy":null}